OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BKP_TAMP</name>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TAMP_CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TAMP1EN</name>
              <description>TAMP enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ITAMP1EN</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TAMP1NOER</name>
              <description>TAMP not erase enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TAMP1MSK</name>
              <description>TAMP enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TAMP1TRG</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_FLTCR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>TAMPFREQ</name>
              <bitRange>[2:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMPFLT</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>RAMPPRCH</name>
              <description>TAMP event flag</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>RAMPPUDIS</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_IER</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TAMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ITAMP1IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_SR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>TAMP1IF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITAMP1F</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_MISR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>TAMP1MF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITAMP1MF</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_SCR</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CTAMP1F</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CITAMP1F</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP0R</name>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP1R</name>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP2R</name>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP3R</name>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP4R</name>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP5R</name>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word5</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP6R</name>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word6</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP7R</name>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word7</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP8R</name>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word8</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP9R</name>
          <addressOffset>0x124</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word9</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP10R</name>
          <addressOffset>0x128</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word10</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP11R</name>
          <addressOffset>0x12C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word11</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP12R</name>
          <addressOffset>0x130</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word12</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP13R</name>
          <addressOffset>0x134</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word13</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP14R</name>
          <addressOffset>0x138</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word14</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP15R</name>
          <addressOffset>0x13C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word15</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP16R</name>
          <addressOffset>0x140</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word16</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP17R</name>
          <addressOffset>0x144</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word17</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP18R</name>
          <addressOffset>0x148</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word18</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP19R</name>
          <addressOffset>0x14C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word19</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP20R</name>
          <addressOffset>0x150</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word20</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP21R</name>
          <addressOffset>0x154</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word21</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP22R</name>
          <addressOffset>0x158</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word22</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP23R</name>
          <addressOffset>0x15C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word23</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP24R</name>
          <addressOffset>0x160</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word24</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP25R</name>
          <addressOffset>0x164</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word25</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP26R</name>
          <addressOffset>0x168</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word26</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP27R</name>
          <addressOffset>0x16C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word27</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP28R</name>
          <addressOffset>0x170</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word28</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP29R</name>
          <addressOffset>0x174</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word29</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP30R</name>
          <addressOffset>0x178</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word30</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP31R</name>
          <addressOffset>0x17C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word31</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
