OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator 1</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for inverting input INM</description>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for non-inverting input</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input selector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity selector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable selector</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode selector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>VCDIV</name>
              <description>VCDIV</description>
              <bitRange>[25:20]</bitRange>
            </field>
            <field>
              <name>VCDIV_EN</name>
              <description>VCDIV_EN</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>VCSEL</name>
              <description>VCSEL</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filter register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator2</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable selector</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for inverting input INM</description>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for non-inverting input</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input selector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity selector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode selector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filter register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN2</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT2</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
