OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
        <register>
          <name>CCCFGR1</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <description>desc CNDTR2</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <description>desc CPAR2</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <description>desc CMAR2</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR2</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <description>desc CNDTR3</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <description>desc CPAR3</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <description>desc CMAR3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR3</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR4</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR4</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR4</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR4</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR5</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR5</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR5</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR5</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
