OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FDCAN</name>
      <baseAddress>0x40006400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ENDN</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>ETV</name>
              <description>Endian Register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBTP</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DSJW</name>
              <description>Data (Re)Synchronization Jump Width</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data time segment after sample point</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DTSEG1</name>
              <description>Data time segment before sample point</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>DBRP</name>
              <description>Data Bit Rate Prescaler</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TDC</name>
              <description>Transmitter Delay Compensation</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>RX</name>
              <description>Receive Pin</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TXBNP</name>
              <description>Tx Buffer Number Prepared</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>PVAL</name>
              <description>Prepared Valid</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBNS</name>
              <description>Tx Buffer Number Started</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>SVAL</name>
              <description>Started Valid</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>WDC</name>
              <description>Watchdog Configuration</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>WDV</name>
              <description>Watchdog Value</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initialization</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCE</name>
              <description>Configuration Change Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASM</name>
              <description>Restricted Operation Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSA</name>
              <description>Clock Stop Acknowledge</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSR</name>
              <description>Clock Stop Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MON</name>
              <description>Bus Monitoring Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DAR</name>
              <description>Disable Automatic Retransmission</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TEST</name>
              <description>Test Mode Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FDOE</name>
              <description>FD Operation Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BRSE</name>
              <description>Bit Rate Switch Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WMM</name>
              <description>Wide Message Marker</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PXHD</name>
              <description>Protocol Exception Handling Disable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EFBI</name>
              <description>Edge Filtering during Bus Integration</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXP</name>
              <description>Transmit Pause</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NISO</name>
              <description>Non ISO Operation</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NBTP</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>NTSEG2</name>
              <description>Nominal Time segment after sample point</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NTSEG1</name>
              <description>Nominal Time segment before sample point</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NBRP</name>
              <description>Nominal Bit Rate Prescaler</description>
              <bitRange>[24:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NSJW</name>
              <description>Nominal (Re)Synchronization Jump Width</description>
              <bitRange>[31:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCC</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TCP</name>
              <description>Timestamp Counter Prescaler</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCV</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>TSC</name>
              <description>Timestamp Counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCC</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>ETOC</name>
              <description>Enable Timeout Counter</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TOS</name>
              <description>Timeout Select</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>TOP</name>
              <description>Timeout Period</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCV</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TOC</name>
              <description>Timeout Counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>TEC</name>
              <description>Transmit Error Counter</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>REC</name>
              <description>Receive Error Counter</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>RP</name>
              <description>Receive Error Passive</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CEL</name>
              <description>CAN Error Logging</description>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>LEC</name>
              <description>Last Error Code</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ACT</name>
              <description>Activity</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DLEC</name>
              <description>Data Phase Last Error Code</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>RESI</name>
              <description>ESI flag of last received CAN FD Message</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RBRS</name>
              <description>BRS flag of last received CAN FD Message</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RFDF</name>
              <description>Received a CAN FD Message</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PXE</name>
              <description>Protocol Exception Event</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TDCV</name>
              <description>Transmitter Delay Compensation Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>TDCF</name>
              <description>Transmitter Delay Compensation Filter Window Length</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TDCO</name>
              <description>Transmitter Delay Compensation SSP Offset</description>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IR</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>RF0N</name>
              <description>Rx FIFO 0 New Message</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF0W</name>
              <description>Rx FIFO 0 Watermark Reached</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF0F</name>
              <description>Rx FIFO 0 Full</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF1N</name>
              <description>Rx FIFO 1 New Message</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF1W</name>
              <description>Rx FIFO 1 Watermark Reached</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF1F</name>
              <description>Rx FIFO 1 Full</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF1L</name>
              <description>Rx FIFO 1 Message Lost</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HPM</name>
              <description>High Priority Message</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission Completed</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TCF</name>
              <description>Transmission Cancellation Finished</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TFE</name>
              <description>Tx FIFO Empty</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TEFN</name>
              <description>Tx Event FIFO New Entry</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TEFW</name>
              <description>Tx Event FIFO Watermark Reached</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TEFF</name>
              <description>Tx Event FIFO Full</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TSW</name>
              <description>Timestamp Wraparound</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>MRAF</name>
              <description>Message RAM Access Failure</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TOO</name>
              <description>Timeout Occurred</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DRX</name>
              <description>Message stored to Dedicated Rx Buffer</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BEC</name>
              <description>Bit Error Corrected</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BEU</name>
              <description>Bit Error Uncorrected</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ELO</name>
              <description>Error Logging Overflow</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>WDI</name>
              <description>Watchdog Interrupt</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PEA</name>
              <description>Protocol Error in Arbitration Phase</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PED</name>
              <description>Protocol Error in Data Phase (Data Bit Time is used)</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ARA</name>
              <description>Access to Reserved Address</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
