OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VR_MODE</name>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>FLSSLP_CTRL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PWR_CLK_SEL</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>PVD_OUT_SEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_CTRL</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EWUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EWUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EWUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EWUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EWUP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EWUP5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EWUP6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EWUP7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LD_EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>WP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>WP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>WP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>WP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>WP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>WP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>WP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Power status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>WUF0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_RDY</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_VOS_RDY</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CWUF0</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF1</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF2</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF3</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF4</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF5</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF6</name>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF7</name>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSBF</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
