OpenPuya/PY32T020_Firmware/Packs/GCC/.pack/Puya/PY32T0xx_DFP/CMSIS/SVD/PY32T092xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>desc SYSCFG</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>desc CFGR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TK_LP_TRIG</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTC_TRIG_TKSEL</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>LPTIM1_TRIG_TKEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LPTIM2_TRIG_TKEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>GPIO_AHB_SEL</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PVDL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ECCL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <description>desc CFGR3</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>DMA4_MAP</name>
              <bitRange>[29:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS_REG</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS_REG</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ENS_REG</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ENS_REG</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PD_ENS</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA_EIIC</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PA_I2C_FMP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB_I2C_FMP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PC_I2C_FMP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PD_I2C_FMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PB_EIIC</name>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>PC_EIIC</name>
              <bitRange>[24:16]</bitRange>
            </field>
            <field>
              <name>PD_EIIC</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PC_PU_IIC</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDCFG</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>SEGIS_EN</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PB_EHS</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PC_ENSEG</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ANA2EN_REG</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>PA_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ANA2EN_REG</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>PB_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ANA2EN_REG</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>PC_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ANA2EN_REG</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PD_ANA2EN</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_IORP</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>PA_IORP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PA_IORP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PA_IORP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PA_IORP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PA_IORP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PA_IORP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PA_IORP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PA_IORP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PA_IORP8</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PA_IORP9</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PA_IORP10</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PA_IORP11</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PA_IORP12</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PA_IORP13</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PA_IORP14</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PA_IORP15</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_IORP</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>PB_IORP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PB_IORP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PB_IORP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PB_IORP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PB_IORP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PB_IORP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PB_IORP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PB_IORP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PB_IORP8</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PB_IORP9</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PB_IORP10</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PB_IORP11</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PB_IORP12</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PB_IORP13</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PB_IORP14</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PB_IORP15</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_IORP</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>PC_IORP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PC_IORP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PC_IORP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PC_IORP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PC_IORP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PC_IORP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PC_IORP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PC_IORP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PC_IORP8</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PC_IORP9</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PC_IORP10</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PC_IORP11</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PC_IORP12</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PC_IORP13</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PC_IORP14</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PC_IORP15</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_IORP</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>PD_IORP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PD_IORP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PD_IORP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PD_IORP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PD_IORP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PD_IORP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PD_IORP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PD_IORP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PD_IORP8</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PD_IORP9</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PD_IORP10</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PD_IORP11</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PD_IORP12</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PD_IORP13</name>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>PERR_RSTEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPF</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPR</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>SYSCFG_SWPR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_OBJCFGR</name>
          <addressOffset>0x17C</addressOffset>
          <fields>
            <field>
              <name>TEST_BOR_LVL</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>TMCLKEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TMVINEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLL_MUL</name>
              <bitRange>[9:5]</bitRange>
            </field>
            <field>
              <name>LCD_TMCLK</name>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>LCD_CDRV</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LCD_SDRV0</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LCD_SDRV</name>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
